load-test.yml
config:
  target: 'https://xxx:8443'
  phases:
    - duration: 60
      arrivalRate: 1
  http:
    tls:
      rejectUnauthorized: false
  defaults:
    headers:
      Accept: application/vnd.apache.thrift.json; charset=utf-8
      Accept-Encoding: gzip, deflate
      Accept-Language: en-US,en;q=0.8
      Cache-Control: no-cache
      Content-Type: application/vnd.apache.thrift.json; charset=UTF-8
      Host: 129.94.120.138:9092
      Origin: http://localhost:4200
      Referer: http://localhost:4200/
      Connection: keep-alive
      User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_5) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.36
      Pragma: no-cache

scenarios:
  - flow:
    - post:
        url: "/"
        headers:
          Content-Length: 88
        body:
          "[1,\"connect\",1,0,{\"1\":{\"str\":\"mapd\"},\"2\":{\"str\":\"HyperInteractive\"},\"3\":{\"str\":\"mapd\"}}]"
        capture:
          json: $[4]['0']['str']
          as: "key"
    # - log: "[1,\"sql_execute\",1,0,{\"1\":{\"str\":\"{{ key }}\"},\"2\":{\"str\":\"SELECT * FROM MGRB WHERE (chromosome = '2') AND (ALT = 'T') AND (c4_REF = 'C') AND ((AF >= 0.9166666666666666 AND AF <= 1)) LIMIT 20 OFFSET 0\"},\"3\":{\"tf\":1},\"4\":{\"str\":\"19\"},\"5\":{\"i32\":-1}}]"

    - post:
        url: "/"
        headers:
          Content-Length: 365
        body:
          "[1,\"sql_execute\",1,0,{\"1\":{\"str\":\"{{ key }}\"},\"2\":{\"str\":\"SELECT cast((cast(c3_START as float) - 52) * 4.012193408842492e-7 as int) as key0,AVG(AF) AS afavg FROM mgrb WHERE (c3_START >= 52 AND c3_START <= 249240280) AND AF IS NOT NULL GROUP BY key0 HAVING key0 >= 0 AND key0 < 100 ORDER BY key0\"},\"3\":{\"tf\":1},\"4\":{\"str\":\"0\"},\"5\":{\"i32\":-1}}]"

    - post:
        url: "/"
        headers:
          Content-Length: 270
        body:
          "[1,\"sql_execute\",1,0,{\"1\":{\"str\":\"{{ key }}\"},\"2\":{\"str\":\"SELECT * FROM MGRB WHERE (chromosome = '2') AND (ALT = 'T') AND (c4_REF = 'C') AND ((AF >= 0.9166666666666666 AND AF <= 1)) LIMIT 20 OFFSET 0\"},\"3\":{\"tf\":1},\"4\":{\"str\":\"1\"},\"5\":{\"i32\":-1}}]"

    # - post:
    #     url: "/"
    #     headers:
    #       Content-Length: 208
    #     body:
    #      "[1,\"sql_execute\",1,0,{\"1\":{\"str\":\"{{ key }}\"},\"2\":{\"str\":\"SELECT chromosome as key0,COUNT(*) AS val FROM mgrb GROUP BY key0 ORDER BY key0\"},\"3\":{\"tf\":1},\"4\":{\"str\":\"2\"},\"5\":{\"i32\":-1}}]"
    #
    # - post:
    #     url: "/"
    #     headers:
    #       Content-Length: 215
    #     body:
    #      "[1,\"sql_execute\",1,0,{\"1\":{\"str\":\"{{ key }}\"},\"2\":{\"str\":\"SELECT ALT as key0,COUNT(*) AS val FROM mgrb GROUP BY key0 ORDER BY val DESC LIMIT 100\"},\"3\":{\"tf\":1},\"4\":{\"str\":\"2\"},\"5\":{\"i32\":-1}}]"
    #
    # - post:
    #     url: "/"
    #     headers:
    #       Content-Length: 218
    #     body:
    #      "[1,\"sql_execute\",1,0,{\"1\":{\"str\":\"{{ key }}\"},\"2\":{\"str\":\"SELECT c4_REF as key0,COUNT(*) AS val FROM mgrb GROUP BY key0 ORDER BY val DESC LIMIT 100\"},\"3\":{\"tf\":1},\"4\":{\"str\":\"2\"},\"5\":{\"i32\":-1}}]"
    #
    # - post:
    #     url: "/"
    #     headers:
    #       Content-Length: 298
    #     body:
    #      "[1,\"sql_execute\",1,0,{\"1\":{\"str\":\"{{ key }}\"},\"2\":{\"str\":\"SELECT cast((cast(AF as float) - 0) * 12 as int) as key0,COUNT(*) AS val FROM mgrb WHERE (AF >= 0 AND AF <= 1) GROUP BY key0 HAVING key0 >= 0 AND key0 < 12 ORDER BY key0\"},\"3\":{\"tf\":1},\"4\":{\"str\":\"2\"},\"5\":{\"i32\":-1}}]"